doc/research/research_ror_jquery-quach.duc/app/controllers/users_controller.rb

  def index
    # Check search request
    params[:search] ? @users = User.where('name LIKE ?', "%#{params[:search]}%") : @users = User.all
---
SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'abcd' LIMIT 1

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `address`, `phone`, `sex`, `created_at`, `updated_at`) VALUES ('abcd', 'avd 12', '123', 1, '2015-03-05 05:52:22.494062', '2015-03-05 05:52:22.494062')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `address` = 'abcsd 12121', `updated_at` = '2015-03-06 08:04:41.964613' WHERE `users`.`id` = 9